[
  {
    "fact": "Harry's parents James and Lily are soulmates because the patronus charm (to ward off Dementors) is a physical representation of one’s soul. Because James' is a stag and Lily's is a doe they are a perfect fit together. "
  },
  {
    "fact": "Rowling has said that if Voldemort saw a boggart it would embody his own corpse, since death was always his greatest fear"
  },
  {
    "fact": "Dumbledore is an Old English word for “bumblebee.” Rowling said she chose the name because she pictured Dumbledore humming to himself"
  },
  {
    "fact": "If Muggles stumbled across Hogwarts, it would look like a dilapidated building with a “Keep Out: Dangerous” sign on it."
  },
  {
    "fact": "Rowling has said that she almost reneged on her promise to herself to keep the Golden Trio alive and killed Ron halfway through the series when she “wasn’t in a very happy place” in her life."
  },
  {
    "fact": "Rowling has admitted that she regrets the relationship between Ron and Hermione."
  },
  {
    "fact": "While filming Prisoner of Azkaban, the pockets of Tom Felton’s Hogwarts robes were sewn shut to stop him sneaking food on set"
  },
  {
    "fact": "When Fred and George Weasley bewitched snowballs to hit Professor Quirrel’s turban, they were unwittingly hitting Voldemort in the face."
  },
  {
    "fact": "On the 10 year anniversary of Harry’s parents’ death and the first time Voldemort was defeated, 31st October 1991, he and Ron saved Hermione from the troll in the bathroom. This is generally regarded as the day the trio became friends"
  },
  {
    "fact": "Sirius Black and Fred Weasley, two tricksters from different generations, both died laughing"
  },
  {
    "fact": "In Prisoner of Azkaban, Trelawney refuses to sit at a table with 12 other characters because she would be the 13th and the first one to get up after that would die. In Order of the Phoenix, 13 members of the order are sitting and Sirius is the first to stand"
  },
  {
    "fact": "Having written half of Goblet of Fire, Rowling realised she had created a “giant hole” in the plot which she had to go back and fix, which is why the book is so long."
  },
  {
    "fact": "The first five years Rowling spent on Harry Potter were spent determining rules about what her characters could and could not do"
  },
  {
    "fact": "Rowling has admitted that Dementors are a physical depiction of her own debilitating experience with depression during her twenties."
  },
  {
    "fact": "In Deathly Hallows, Harry notes that Ron and Hermione had fallen asleep holding hands. Hermione’s Patronus is an otter, which sleep holding hands with other otters. Incidentally, Ron’s Patronus is a Jack Russell Terrier, known for chasing otters…"
  },
  {
    "fact": "Daniel Radcliffe and Rupert Grint both admit to having a crush on Emma Watson in earlier films."
  },
  {
    "fact": "While filming the kissing scene between the horcrux versions of Harry and Hermione in Deathly Hallows – Part 2 Ron had to be removed from set for laughing hysterically"
  },
  {
    "fact": "Tom Felton, who plays Draco Malfoy, originally auditioned for the roles of Harry and Ron."
  },
  {
    "fact": "The first Harry Potter book was published in 1998, the same year the final Battle of Hogwarts was fought. Rowling has said, 'I open at the close'"
  },
  {
    "fact": "Rowling has previously stated the Harry Potter books might not have come to fruition if her mother hadn’t died. “The books are what they are because she died … because I loved her and she died.”"
  }
]
